SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;


CREATE TABLE IF NOT EXISTS `#__slr_departments` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='Подразделения';

INSERT INTO `#__slr_departments` (`id`, `title`) VALUES
(1, 'Эксплуатационное'),
(2, 'Хозяйственное'),
(4, 'Бухгалтерия');

CREATE TABLE IF NOT EXISTS `#__slr_employers` (
  `id` int(11) NOT NULL,
  `dep_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `fio` varchar(100) NOT NULL,
  `date_start` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `date_end` timestamp NULL DEFAULT NULL,
  `wage` float NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COMMENT='Сотрудники';

INSERT INTO `#__slr_employers` (`id`, `dep_id`, `post_id`, `fio`, `date_start`, `date_end`, `wage`) VALUES
(1, 1, 2, 'Иванов Иван Иванович', '2017-12-31 21:00:00', NULL, 1),
(2, 4, 4, 'Петрова Анастасия Викторовна', '2017-12-31 21:00:00', NULL, 1),
(3, 2, 5, 'Ахмедова Зухра Фаридовна', '2017-12-31 21:00:00', NULL, 1),
(4, 1, 1, 'Васильев Василий Васильевич', '2017-12-31 21:00:00', NULL, 0.5),
(5, 1, 2, 'Сидоров Анатолий Анатольевич', '2017-12-31 21:00:00', '2018-03-09 21:00:00', 1);

CREATE TABLE IF NOT EXISTS `#__slr_fines` (
  `id` int(11) NOT NULL,
  `employer_id` int(11) NOT NULL,
  `fine_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `amount` float NOT NULL,
  `comment` varchar(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='Штрафы';

INSERT INTO `#__slr_fines` (`id`, `employer_id`, `fine_time`, `amount`, `comment`) VALUES
(1, 1, '2018-01-10 21:00:00', 2000, 'Курение на рабочем месте');

CREATE TABLE IF NOT EXISTS `#__slr_posts` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `salary` float NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COMMENT='Должности';

INSERT INTO `#__slr_posts` (`id`, `title`, `salary`) VALUES
(1, 'Прораб', 200),
(2, 'Монтажник', 180.5),
(4, 'Бухгалтер', 130),
(5, 'Уборщик', 100);

CREATE TABLE IF NOT EXISTS `#__slr_works` (
  `id` int(11) NOT NULL,
  `employer_id` int(11) NOT NULL,
  `time_start` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `time_end` timestamp NULL DEFAULT NULL,
  `sick` tinyint(4) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='Учёт рабочего времени';

INSERT INTO `#__slr_works` (`id`, `employer_id`, `time_start`, `time_end`, `sick`) VALUES
(1, 3, '2018-02-01 06:00:00', '2018-02-01 15:00:00', 0),
(2, 1, '2018-02-01 06:00:00', '2018-02-01 15:00:00', 0),
(3, 2, '2018-02-01 06:00:00', '2018-02-01 15:00:00', 0),
(4, 4, '2018-02-01 06:00:00', '2018-02-11 15:00:00', 0),
(5, 3, '2018-02-02 06:00:00', '2018-02-02 15:00:00', 0),
(6, 1, '2018-02-02 06:00:00', '2018-02-02 15:00:00', 0),
(7, 2, '2018-02-02 06:00:00', '2018-02-02 15:00:00', 0),
(8, 4, '2018-02-02 06:00:00', '2018-02-02 15:00:00', 0),
(9, 3, '2018-02-05 06:00:00', '2018-02-05 15:00:00', 0),
(10, 1, '2018-02-05 06:00:00', '2018-02-05 15:00:00', 0),
(11, 2, '2018-02-05 06:00:00', '2018-02-05 15:00:00', 0),
(12, 4, '2018-02-05 06:00:00', '2018-02-05 15:00:00', 0),
(13, 3, '2018-02-06 06:00:00', '2018-02-06 15:00:00', 0),
(14, 1, '2018-02-06 06:00:00', '2018-02-06 15:00:00', 0),
(15, 2, '2018-02-06 06:00:00', '2018-02-06 15:00:00', 0),
(16, 4, '2018-02-06 06:00:00', '2018-02-06 15:00:00', 0),
(17, 3, '2018-02-07 06:00:00', '2018-02-07 15:00:00', 0),
(18, 1, '2018-02-07 06:00:00', '2018-02-07 15:00:00', 0),
(19, 2, '2018-02-07 06:00:00', '2018-02-07 15:00:00', 0),
(20, 4, '2018-02-07 06:00:00', '2018-02-07 15:00:00', 0),
(21, 3, '2018-02-08 06:00:00', '2018-02-08 15:00:00', 0),
(22, 1, '2018-02-08 06:00:00', '2018-02-08 15:00:00', 0),
(23, 2, '2018-02-08 06:00:00', '2018-02-08 15:00:00', 0),
(24, 4, '2018-02-08 06:00:00', '2018-02-08 15:00:00', 0),
(25, 3, '2018-02-09 06:00:00', '2018-02-09 15:00:00', 0),
(26, 1, '2018-02-09 06:00:00', '2018-02-09 15:00:00', 0),
(27, 2, '2018-02-09 06:00:00', '2018-02-09 15:00:00', 0),
(28, 4, '2018-02-09 06:00:00', '2018-02-09 15:00:00', 0),
(29, 3, '2018-02-12 06:00:00', '2018-02-12 15:00:00', 0),
(30, 1, '2018-02-12 06:00:00', '2018-02-12 15:00:00', 0),
(31, 2, '2018-02-12 06:00:00', '2018-02-12 15:00:00', 0),
(32, 4, '2018-02-12 06:00:00', '2018-02-12 15:00:00', 0),
(33, 3, '2018-02-13 06:00:00', '2018-02-13 15:00:00', 0),
(34, 1, '2018-02-13 06:00:00', '2018-02-13 15:00:00', 0),
(35, 2, '2018-02-13 06:00:00', '2018-02-13 15:00:00', 0),
(36, 4, '2018-02-13 06:00:00', '2018-02-13 15:00:00', 0),
(37, 3, '2018-02-14 06:00:00', '2018-02-14 15:00:00', 0),
(38, 1, '2018-02-14 06:00:00', '2018-02-14 15:00:00', 0),
(39, 2, '2018-02-14 06:00:00', '2018-02-14 15:00:00', 0),
(40, 4, '2018-02-14 06:00:00', '2018-02-14 15:00:00', 0),
(41, 3, '2018-02-15 06:00:00', '2018-02-15 15:00:00', 0),
(42, 1, '2018-02-15 06:00:00', '2018-02-15 15:00:00', 0),
(43, 2, '2018-02-15 06:00:00', '2018-02-15 15:00:00', 0),
(44, 4, '2018-02-15 06:00:00', '2018-02-15 15:00:00', 0),
(45, 3, '2018-02-16 06:00:00', '2018-02-16 15:00:00', 0),
(46, 1, '2018-02-16 06:00:00', '2018-02-16 15:00:00', 0),
(47, 2, '2018-02-16 06:00:00', '2018-02-16 15:00:00', 0),
(48, 4, '2018-02-16 06:00:00', '2018-02-16 15:00:00', 0),
(49, 3, '2018-02-19 06:00:00', '2018-02-19 15:00:00', 0),
(50, 1, '2018-02-19 06:00:00', '2018-02-19 15:00:00', 0),
(51, 2, '2018-02-19 06:00:00', '2018-02-19 15:00:00', 0),
(52, 4, '2018-02-19 06:00:00', '2018-02-19 15:00:00', 0),
(53, 3, '2018-02-20 06:00:00', '2018-02-20 15:00:00', 0),
(54, 1, '2018-02-20 06:00:00', '2018-02-20 15:00:00', 0),
(55, 2, '2018-02-20 06:00:00', '2018-02-20 15:00:00', 0),
(56, 4, '2018-02-20 06:00:00', '2018-02-20 15:00:00', 0),
(57, 3, '2018-02-21 06:00:00', '2018-02-21 15:00:00', 0),
(58, 1, '2018-02-21 06:00:00', '2018-02-21 15:00:00', 0),
(59, 2, '2018-02-21 06:00:00', '2018-02-21 15:00:00', 0),
(60, 4, '2018-02-21 06:00:00', '2018-02-21 15:00:00', 0),
(61, 3, '2018-02-22 06:00:00', '2018-02-22 15:00:00', 0),
(62, 1, '2018-02-22 06:00:00', '2018-02-22 15:00:00', 0),
(63, 2, '2018-02-22 06:00:00', '2018-02-22 15:00:00', 0),
(64, 4, '2018-02-22 06:00:00', '2018-02-22 15:00:00', 0),
(65, 3, '2018-02-26 06:00:00', '2018-02-26 15:00:00', 0),
(66, 1, '2018-02-26 06:00:00', '2018-02-26 15:00:00', 0),
(67, 2, '2018-02-26 06:00:00', '2018-02-26 15:00:00', 0),
(68, 4, '2018-02-26 06:00:00', '2018-02-26 15:00:00', 0),
(69, 3, '2018-02-27 06:00:00', '2018-02-27 15:00:00', 0),
(70, 1, '2018-02-27 06:00:00', '2018-02-27 15:00:00', 0),
(71, 2, '2018-02-27 06:00:00', '2018-02-27 15:00:00', 0),
(72, 4, '2018-02-27 06:00:00', '2018-02-27 15:00:00', 0),
(73, 3, '2018-02-28 06:00:00', '2018-02-28 15:00:00', 0),
(74, 1, '2018-02-28 06:00:00', '2018-02-28 15:00:00', 0),
(75, 2, '2018-02-28 06:00:00', '2018-02-28 15:00:00', 0),
(76, 4, '2018-02-28 06:00:00', '2018-02-28 15:00:00', 0),
(77, 3, '2018-03-01 06:00:00', '2018-03-01 15:00:00', 0),
(78, 1, '2018-03-01 06:00:00', '2018-03-01 15:00:00', 0),
(79, 2, '2018-03-01 06:00:00', '2018-03-01 15:00:00', 0),
(80, 4, '2018-03-01 06:00:00', '2018-03-01 15:00:00', 0),
(81, 3, '2018-03-02 06:00:00', '2018-03-02 15:00:00', 0),
(82, 1, '2018-03-02 06:00:00', '2018-03-02 15:00:00', 0),
(83, 2, '2018-03-02 06:00:00', '2018-03-02 15:00:00', 0),
(84, 4, '2018-03-02 06:00:00', '2018-03-02 15:00:00', 0),
(85, 3, '2018-03-05 06:00:00', '2018-03-05 15:00:00', 0),
(86, 1, '2018-03-05 06:00:00', '2018-03-05 15:00:00', 0),
(87, 2, '2018-03-05 06:00:00', '2018-03-05 15:00:00', 0),
(88, 4, '2018-03-05 06:00:00', '2018-03-05 15:00:00', 0),
(89, 3, '2018-03-06 06:00:00', '2018-03-06 15:00:00', 0),
(90, 1, '2018-03-06 06:00:00', '2018-03-06 15:00:00', 0),
(91, 2, '2018-03-06 06:00:00', '2018-03-06 15:00:00', 0),
(92, 4, '2018-03-06 06:00:00', '2018-03-06 15:00:00', 0),
(93, 3, '2018-03-07 06:00:00', '2018-03-07 15:00:00', 0),
(94, 1, '2018-03-07 06:00:00', '2018-03-07 15:00:00', 0),
(95, 2, '2018-03-07 06:00:00', '2018-03-07 15:00:00', 0),
(96, 4, '2018-03-07 06:00:00', '2018-03-07 15:00:00', 0);


ALTER TABLE `#__slr_departments`
  ADD PRIMARY KEY (`id`);

ALTER TABLE `#__slr_employers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `dep_id` (`dep_id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `fio` (`fio`);

ALTER TABLE `#__slr_fines`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employer_id` (`employer_id`);

ALTER TABLE `#__slr_posts`
  ADD PRIMARY KEY (`id`);
  
  
ALTER TABLE `#__slr_works`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employer_id` (`employer_id`);


ALTER TABLE `#__slr_departments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
ALTER TABLE `#__slr_employers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
ALTER TABLE `#__slr_fines`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
ALTER TABLE `#__slr_posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
ALTER TABLE `#__slr_works`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=97;

ALTER TABLE `#__slr_employers`
  ADD CONSTRAINT `#__slr_employers_ibfk_1` FOREIGN KEY (`dep_id`) REFERENCES `#__slr_departments` (`id`),
  ADD CONSTRAINT `#__slr_employers_ibfk_2` FOREIGN KEY (`post_id`) REFERENCES `#__slr_posts` (`id`);

ALTER TABLE `#__slr_fines`
  ADD CONSTRAINT `#__slr_fines_ibfk_1` FOREIGN KEY (`employer_id`) REFERENCES `#__slr_employers` (`id`);

ALTER TABLE `#__slr_works`
  ADD CONSTRAINT `#__slr_works_ibfk_1` FOREIGN KEY (`employer_id`) REFERENCES `#__slr_employers` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
